.doom.d/Emacs.org
* Web browser
#+begin_src emacs-lisp
;; (use-package! eaf
;;   :load-path "~/.doom.d/site-lisp/emacs-application-framework"
;;   :custom
;;   ; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
;;   (eaf-browser-continue-where-left-off t)
;;   (eaf-browser-enable-adblocker t)
;;   (browse-url-browser-function 'eaf-open-browser)
;;   :config
;;   (defalias 'browse-web #'eaf-open-browser))
;;   ;; (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
;;   ;; (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
;;   ;; (eaf-bind-key take_photo "p" eaf-camera-keybinding)
;;   ;; (eaf-bind-key nil "M-q" eaf-browser-keybinding)) ;; unbind, see more in the Wiki
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.doom.d/site-lisp/emacs-application-framework/")
#+end_src

#+RESULTS:
| ~/.doom.d/site-lisp/emacs-application-framework/ | ~/.doom.d/sit |

# #+begin_src emacs-lisp
# # (require 'eaf)
# # (require 'eaf-browser)
# # #+end_src

#+RESULTS:
: eaf-browser
* Python
** Anaconda

#+begin_src emacs-lisp :tangle packages.el
(package! conda)
#+end_src

#+begin_src emacs-lisp
;; (use-package! conda
;;   :config
;;   ;; (setq
;;   ;;  conda-env-home-directory (expand-file-name "~/opt/miniconda3/")
;;   ;;  conda-env-subdirectory "envs/")
;;   (custom-set-variables '(conda-anaconda-home "/opt/miniconda3/"))
;;   (conda-env-initialize-interactive-shells)
;;   (conda-env-initialize-eshell)
;;   (conda-env-autoactivate-mode t))
#+end_src
** Ipython
#+begin_src emacs-lisp :tangle packages.el
(package! ein)
#+end_src

#+begin_src emacs-lisp
;; (use-package! ein)
;; (require 'ein)
#+end_src

* Haskell
#+begin_src emacs-lisp :tangle no
(use-package! haskell-mode
  :config
  (define-key! map [?\C-c ?r] 'haskell-run))
#+end_src

#+RESULTS:
: t

* Go
#+begin_src emacs-lisp
;; (use-package! go-complete
;;   :config
;;  (add-hook 'completion-at-point-functions 'go-complete-at-point))
#+end_src

#+begin_src emacs-lisp :eval yes
(setq gofmt-command "goimports")
(add-hook 'before-save-hook 'gofmt-before-save)
#+end_src

#+RESULTS:
| gofmt-before-save | undo-fu-session-save-safe |

* Xthemes
#+begin_src emacs-lisp :tangle packages.el
(package! ewal-doom-themes)
(package! doom-themes)
(package! doom-modeline-now-playing)
(package! doom-modeline)
#+end_src
#+RESULTS:
: doom-modeline

#+begin_src emacs-lisp
(use-package! doom-modeline
  :config
  ;; (setq doom-modeline-height 20)
  ;; (setq doom-modeline-bar-width 3)
  ;; (setq doom-modeline-height 1) ; optional
  (setq doom-modeline-buffer-file-name-style 'truncate-upto-root)
  (custom-set-faces
    '(mode-line ((t (:family "Gayathri" :size 13)))) ;; Free Sans
    '(mode-line-active ((t (:family "Gayathri" :size 13)))) ; For 29+
    '(mode-line-inactive ((t (:family "Gayathri" :size 13))))))
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-monokai-pro t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  ;; (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  ;; (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))


#+end_src
* W3M
#+begin_src emacs-lisp
;; (use-package! w3m
;;   :config
;;   (setq w3m-search-default-engine "duckduckgo"))
#+end_src
* Types of Searches
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("s" . "search")
        :desc "w3m search" "s" #'w3m-search
        :desc "dictionary search" "d" #'dictionary-search)))
#+end_src

#+RESULTS:
: dictionary-search

* LaTeX
** AUCTeX

#+begin_src emacs-lisp :tangle packages.el :tangle no
(package! auctex)
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! auctex
  :ensure tex-mode
  :hook (tex-mode . auctex-mode))
#+end_src

#+RESULTS:
| auctex-mode |
#+RESULTS:
** LaTeX Extra features for editing
#+begin_src emacs-lisp
      ;; (use-package latex-extra)
#+end_src

** Pygments
#+begin_src emacs-lisp :tangle no
(eval-after-load "tex"
  '(setcdr (assoc "LaTeX" TeX-command-list)
          '("%`%l%(mode) -shell-escape%' %t"
            TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX")))
#+end_src

#+RESULTS:
| %`%l%(mode) -shell-escape%' %t | TeX-run-TeX | nil | (latex-mode doctex-mode) | :help | Run LaTeX |


#+name: setup-minted
#+begin_src emacs-lisp :exports both :results silent :tangle no
(setq org-latex-listings 'minted)
(setq org-latex-custom-lang-environments
 '((emacs-lisp "common-lispcode")))
(setq org-latex-minted-options
      '(("frame" "lines")
        ("fontsize" "\\scriptsize")
        ("linenos" "false")
        ("bgcolor" "LightGray")))
(setq org-latex-to-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src

** Output
#+begin_src emacs-lisp
   ;; ; SyncTeX basics

   ;; ; un-urlify and urlify-escape-only should be improved to handle all special characters, not only spaces.
   ;; ; The fix for spaces is based on the first comment on http://emacswiki.org/emacs/AUCTeX#toc20

   ;; (defun un-urlify (fname-or-url)
   ;;   "Transform file:///absolute/path from Gnome into /absolute/path with very limited support for special characters"
   ;;   (if (string= (substring fname-or-url 0 8) "file:///")
   ;;       (url-unhex-string (substring fname-or-url 7))
   ;;     fname-or-url))

   ;; (defun urlify-escape-only (path)
   ;;   "Handle special characters for urlify"
   ;;   (replace-regexp-in-string " " "%20" path))

   ;; (defun urlify (absolute-path)
   ;;   "Transform /absolute/path to file:///absolute/path for Gnome with very limited support for special characters"
   ;;   (if (string= (substring absolute-path 0 1) "/")
   ;;       (concat "file://" (urlify-escape-only absolute-path))
   ;;       absolute-path))


   ;; ; SyncTeX backward search - based on http://emacswiki.org/emacs/AUCTeX#toc20, reproduced on https://tex.stackexchange.com/a/49840/21017

   ;; (defun th-evince-sync (file linecol &rest ignored)
   ;;   (let* ((fname (un-urlify file))
   ;;          (buf (find-file fname))
   ;;          (line (car linecol))
   ;;          (col (cadr linecol)))
   ;;     (if (null buf)
   ;;         (message "[Synctex]: Could not open %s" fname)
   ;;       (switch-to-buffer buf)
   ;;       (goto-line (car linecol))
   ;;       (unless (= col -1)
   ;;         (move-to-column col)))))

   ;; (defvar *dbus-evince-signal* nil)

   ;; (defun enable-evince-sync ()
   ;;   (require 'dbus)
   ;;   ; cl is required for setf, taken from: http://lists.gnu.org/archive/html/emacs-orgmode/2009-11/msg01049.html
   ;;   (require 'cl)
   ;;   (when (and
   ;;          (eq window-system 'x)
   ;;          (fboundp 'dbus-register-signal))
   ;;     (unless *dbus-evince-signal*
   ;;       (setf *dbus-evince-signal*
   ;;             (dbus-register-signal
   ;;              ;; :session nil "/org/gnome/evince/Window/0"
   ;;              "org.gnome.evince.Window" "SyncSource"
   ;;              'th-evince-sync)))))

   ;; (add-hook 'LaTeX-mode-hook 'enable-evince-sync)


   ;; ; SyncTeX forward search - based on https://tex.stackexchange.com/a/46157

   ;; ;; universal time, need by evince
   ;; (defun utime ()
   ;;   (let ((high (nth 0 (current-time)))
   ;;         (low (nth 1 (current-time))))
   ;;    (+ (* high (lsh 1 16) ) low)))

   ;; ;; Forward search.
   ;; ;; Adapted from http://dud.inf.tu-dresden.de/~ben/evince_synctex.tar.gz
   ;; ;; (defun auctex-evince-forward-sync (pdffile texfile line)
   ;; ;;   (let ((dbus-name
   ;; ;;      (dbus-call-method :session
   ;; ;;                "org.gnome.evince.Daemon"  ; service
   ;; ;;                "/org/gnome/evince/Daemon" ; path
   ;; ;;                "org.gnome.evince.Daemon"  ; interface
   ;; ;;                "FindDocument"
   ;; ;;                (urlify pdffile)
   ;; ;;                t     ; Open a new window if the file is not opened.
   ;; ;;                )))
   ;; ;;     (dbus-call-method :session
   ;; ;;           dbus-name
   ;; ;;           "/org/gnome/evince/Window/0"
   ;; ;;           "org.gnome.evince.Window"
   ;; ;;           "SyncView"
   ;; ;;           (urlify-escape-only texfile)
   ;; ;;           (list :struct :int32 line :int32 1)
   ;; ;;   (utime))))

   ;; ;; (defun auctex-evince-view ()
   ;; ;;   (let ((pdf (file-truename (concat default-directory
   ;; ;;                     (TeX-master-file (TeX-output-extension)))))
   ;; ;;     (tex (buffer-file-name))
   ;; ;;     (line (line-number-at-pos)))
   ;; ;;     (auctex-evince-forward-sync pdf tex line)))

   ;; ;; New view entry: Evince via D-bus.
   ;; (setq TeX-view-program-list '())
   ;; (add-to-list 'TeX-view-program-list
   ;;          '("evince" auctex-evince-view))

   ;; ;; Prepend Evince via D-bus to program selection list
   ;; ;; overriding other settings for PDF viewing.
   ;; (setq TeX-view-program-selection '())
   ;; (add-to-list 'TeX-view-program-selection
   ;;          '(output-pdf "evince"))
#+end_src

#+RESULTS:
| output-pdf | evince |


#+begin_src emacs-lisp :tangle no
(setq TeX-PDF-mode t)

(defun pdfevince ()
   (add-to-list 'TeX-output-view-style
                 '("^pdf$" "." "evince %o %(outpage)")))


(defun pdfokular ()
   (add-to-list 'TeX-output-view-style
                 '("^pdf$" "." "okular %o %(outpage)")))


   ;; (add-hook  'LaTeX-mode-hook  'pdfevince  t) ; AUCTeX LaTeX mode
(add-hook  'LaTeX-mode-hook  'pdfokular  t) ; AUCTeX LaTeX mode
#+end_src

#+RESULTS:
| pdfevince |

** Output evince setup
#+begin_src emacs-lisp :tangle no
(load "auctex.el" nil t t)
   ;; (load "preview-latex.el" nil t t)
#+end_src

#+RESULTS:
: t

** Preview
#+begin_src emacs-lisp :tangle packages.el
(package! latex-preview-pane)
(package! latex-pretty-symbols)
(package! pretty-symbols)
#+end_src

#+begin_src emacs-lisp
(use-package! latex-preview-pane)
(use-package! latex-pretty-symbols)
(defun my-pretty-lambda ()
  "make some word or string show as pretty Unicode symbols"
  (setq prettify-symbols-alist
        '(
          ("lambda" . 955) ; λ
          )))

;;(add-hook 'scheme-mode-hook 'my-pretty-lambda)
(global-prettify-symbols-mode 1)
#+end_src

#+RESULTS:
: t


#+begin_src emacs-lisp :tangle no
(setq TeX-PDF-mode t)
(require 'tex)
(TeX-global-PDF-mode t)
#+end_src

#+RESULTS:
: t
** Auto-complete
#+begin_src emacs-lisp
;; (use-package! auto-complete-auctex)
#+end_src

#+RESULTS:

* Pressentation
** Org Reveal

#+begin_src emacs-lisp :tangle packages.el
(package! ox-reveal)
(package! impatient-mode)
(package! celestial-mode-line)
#+end_src

#+begin_src emacs-lisp :tangle no
(require 'ox-reveal)
#+end_src

#+RESULTS:
: ox-reveal

* Java
#+begin_src emacs-lisp :tangle packages.el :tangle no
(package! lsp-sonarlint)
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! lsp-sonarlint
  :config
  (require 'lsp-sonarlint)
  (setq lsp-sonarlint-java-enabled t))
#+end_src
* SQL

#+begin_src emacs-lisp :tangle packages.el
(package! sqlformat)
#+end_src

#+begin_src emacs-lisp
;; (use-package! sqlformat
;;   :config
;;   (setq sqlformat-command 'pgformatter)
;;   (add-hook 'sql-mode-hook 'sqlformat-on-save-mode))
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp :tangle packages.el
(package! emacsql-mysql)
(package! ob-sql-mode)
(package! sqlformat)
(package! esqlite)
(package! sql-indent)
(package! sqlup-mode)
(package! emacsql-psql)
(package! emacsql-mysql)
(package! emacsql-sqlite-module)
(package! emacsql-sqlite-builtin)
#+end_src

* Cursor lock-screen (scrolling behavior)
#+begin_src emacs-lisp :tangle packages.el
(package! centered-cursor-mode)
#+end_src

* Pomodoro
#+begin_src emacs-lisp :tangle packages.el
(package! org-pomodoro)
#+end_src

* Custom bindings
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
        :desc "centered-cursor-mode" "C-l" #'centered-cursor-mode)
      (:desc "anzu-replace" "r" #'anzu-replace-at-cursor-thing))
#+end_src

* Chinese
#+begin_src emacs-lisp :tangle packages.el
(package! pyim)
(package! pyim-basedict)
#+end_src

* Shortcuts to load modules, as needed

To create new loadable modules,

#+begin_src emacs-lisp
(load! "./my-func/define-modules.el")
#+end_src

#+begin_src emacs-lisp
(load! "./my-func/load-modules.el")
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("l" . "load module")
        :desc "Chinese" "c" #'lw/load-chinese
        :desc "LaTeX" "l" #'lw/load-latex)))
#+end_src

* Datomic snippets?
#+begin_src emacs-lisp :tangle packages.el
;; (package! datomic-snippets)
#+end_src
* Current time function

#+begin_src emacs-lisp
(load! "./my-func/isosec.el")
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("z" . "Zettle funcs")
          :desc "Isosec" "i" #'blw/insert-current-isosec)))
#+end_src
#+RESULTS:
: blw/insert-current-isosec
* Markdown
#+begin_src emacs-lisp :tangle packages.el
(package! flymd)
#+end_src
* EPUB reader
#+begin_src emacs-lisp :tangle packages.el
(package! nov)
#+end_src

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix-map ("r" . "read")
        :desc "EPUB refresh size" "r" #'nov-render-document)))
#+end_src

#+RESULTS:
: nov-render-document
* Emoji
#+begin_src emacs-lisp :tangle packages.el
(package! emojify)
#+end_src

* Fixes
#+begin_src emacs-lisp :tangle packages.el
(package! pyim-basedict)
(package! pyim)
(package! bing-dict)
(package! zh-align
  :recipe (:host github
           :repo "chen-chao/zh-align.el"))
(package! doom-themes)
(package! evil-collection)
(package! bing-dict)
(package! straight :pin "3eca39d")
#+end_src

#+begin_src emacs-lisp
(load! "./my-func/fast-input-method.el")
(evil-mode)
#+end_src

* RevealJS
#+begin_src emacs-lisp :tangle packages.el
(package! ox-reveal)
(package! impatient-mode)
;; (package! httpd)
#+end_src

#+begin_src emacs-lisp
(require 'ox-reveal)
#+end_src
#
# #+RESULTS:
# : ox-reveal
#+begin_src emacs-lisp
;; (use-package impatient-mode)
#+end_src
* JavaScript
