.doom.d/Emacs.org
** Eslint
#+begin_src emacs-lisp :tangle packages.el
(package! eslint-rc)
(package! setup)
;; (use-package! flymake-eslint
;;   :config
;;   (add-hook web-mode-hook flymake-eslint-enable))
#+end_src

#+begin_src emacs-lisp
(add-hook 'typescript-mode-hook 'eslint-rc-mode)
(add-hook 'js2-mode-hook 'eslint-rc-mode)
(add-hook 'web-mode-hook 'eslint-rc-mode)
#+end_src

#+begin_src emacs-lisp :tangle ~/dotfiles/.config/facti/.dir-local.el
;; dir-local.el for facti's js setup
((rjsx-mode . ((eval . (setq js-indent-level 2))
               (eval . (setq indent-tabs-mode nil))
               (eval . (setq tab-width 4))
               (eval . (setq indent-line-function 'insert-tab))))) 
#+end_src

** Hooks
#+begin_src emacs-lisp
(add-hook 'rjsx-mode-hook 'tide-mode)
#+end_src

** JSX
#+begin_src emacs-lisp
;; use web-mode for .jsx files
(add-to-list 'auto-mode-alist '("\\.jsx$" . web-mode))

;; http://www.flycheck.org/manual/latest/index.html
(require 'flycheck)

;; turn on flychecking globally
(add-hook 'after-init-hook #'global-flycheck-mode)

;; disable jshint since we prefer eslint checking
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(javascript-jshint)))

;; use eslint with web-mode for jsx files
(flycheck-add-mode 'javascript-eslint 'web-mode)

;; customize flycheck temp file prefix
(setq-default flycheck-temp-prefix ".flycheck")

;; disable json-jsonlist checking for json files
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(json-jsonlist)))

;; https://github.com/purcell/exec-path-from-shell
;; only need exec-path-from-shell on OSX
;; this hopefully sets up path and other vars better
(when (memq window-system '(mac ns))
  (exec-path-from-shell-initialize))
#+end_src

#+begin_src emacs-lisp
(add-hook 'web-mode-hook 'lsp-defered)
#+end_src

#+RESULTS:
| lsp-defered | er/add-web-mode-expansions | er/add-html-mode-expansions | +web--fix-js-comments-h | eslint-rc-mode | doom--enable-+web-wordpress-mode-in-web-mode-h | doom--enable-+web-django-mode-in-web-mode-h | doom--enable-+web-jekyll-mode-in-web-mode-h | emmet-mode | doom--enable-+javascript-npm-mode-in-web-mode-h |
** Indium
#+begin_src emacs-lisp :tangle packages.el
(package! indium)
#+end_src

** Slime-js
#+begin_src emacs-lisp :tangle packages.el
;; (package! sly :disable t)
;; (package! sly-macrostep :disable t)
;; (package! sly-repl-ansi-color :disable t)
;; (package! slime)
;; (package! slime-js
;;         :recipe (:host github
;;                  :repo "swank-js/swank-js"))
#+end_src

#+begin_src emacs-lisp
;; (use-package! slime
;;   :config (setq inferior-lisp-program "sbcl"))
#+end_src

#+RESULTS:
: t

** Keymaps
#+begin_src emacs-lisp
(defun insert-file-name ()
  "Insert the full path file name into the current buffer."
  (interactive)
  (insert (concat (buffer-file-name (window-buffer (minibuffer-selected-window))) " " (what-line))))
#+end_src

#+RESULTS:
: insert-file-name

#+begin_src emacs-lisp
(map! :after evil-mode
      :map tide-mode-map
      "C-." nil)

(map! :map tide-mode-map
      "C-." 'tide-jump-to-definition
      "C-," 'tide-jump-back)
#+end_src


#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("j" . "javascript")
        :desc "go-to definition" "." #'tide-jump-to-definition
        :desc "go-to implementation" "," #'tide-jump-implementation
        :desc "back from go-to" "," #'tide-jump-back)))

;; Insert file name:
;; To easily point out stuff in files, in documentation processes
;; and team alignments etc.

(map! :leader
      (:prefix-map ("b" . "buddhi")
       :desc "insert file name" "n" #'insert-file-name))
#+end_src

#+RESULTS:
: insert-file-name

* General Web Dev
** Keymaps
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("w" . "web")
        :desc "attribute match" "m" #'web-mode-tag-match)))
#+end_src

* Copilot
#+begin_src emacs-lisp :tangle packages.el
(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
#+end_src

#+begin_src emacs-lisp
;; accept completion from copilot and fallback to company
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (("C-TAB" . 'copilot-accept-completion-by-word)
         ("C-<tab>" . 'copilot-accept-completion-by-word)
         :map copilot-completion-map
         ("<tab>" . 'copilot-accept-completion)
         ("TAB" . 'copilot-accept-completion)))
#+end_src

** Keymaps
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("c" . "Co-pilot")
        :desc "Accept full completion" "TAB" #'copilot-accept-completion)))

(map! :leader
      (:prefix-map ("b" . "buddhi")
        :desc "Accept full completion" "TAB" #'copilot-accept-completion))
#+end_src

#+RESULTS:
: copilot-accept-completion
* Pomodoro
#+begin_src emacs-lisp
;; From  time.el -> display-time-mode
(defun lw/display-time-event-handler ()
  (display-time-update)
  (let* ((current (current-time))
	 (timer display-time-timer)
	 ;; Compute the time when this timer will run again, next.
	 (next-time (timer-relative-time
		     (list (aref timer 1) (aref timer 2) (aref timer 3))
		     (* 5 (aref timer 4)) 0)))
    ;; If the activation time is not in the future,
    ;; skip executions until we reach a time in the future.
    ;; This avoids a long pause if Emacs has been suspended for hours.
    (or (time-less-p current next-time)
	(progn
	  (timer-set-time timer (timer-next-integral-multiple-of-time
				 current display-time-interval)
			  display-time-interval)
	  (timer-activate timer)))))

(defun lw/timer-pomo ()
  (let ((pomo-output (shell-command-to-string "sb-pomo | tr -d '\n'")))
    (if (equal "" pomo-output)
        (progn
          (cancel-function-timers 'lw/timer-pomo)
          (setq-default mode-line-misc-info "No pomodoro running"))
        (setq-default mode-line-misc-info pomo-output))))

(defun lw/pomodoro-echo ()
  (interactive
   (run-with-timer 0 1 'lw/timer-pomo)
   (run-at-time t 1 'lw/display-time-event-handler)))

(defun lw/kill-pomo-updates ()
  (interactive
   (progn
     (cancel-function-timers 'lw/timer-pomo)
     (cancel-function-timers 'lw/display-time-event-handler)
     (setq-default mode-line-misc-info nil))))
#+end_src

#+RESULTS:
: lw/kill-pomo-updates

* Org
#+begin_src emacs-lisp :tangle packages.el
(package! org-bullets)
(package! org-superstar)
#+end_src

#+begin_src emacs-lisp
(use-package! org-bullets
  :after org
  ;; :hook (org-mode . org-bullets)
  :custom
  ;; (org-superstar-remove-leading-stars t)
  (org-bullets-bullet-list '("家" "ॐ" "同" "Ø" "א" "҉ " "҈ ")))

(use-package! org-superstar
  ;; :if (not dw/is-termux)
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  (org-superstar-headline-bullets-list '("家" "ॐ" "同" "Ø" "א" "҉ " "҈ ")))
                                       ;; Make sure org-indent face is available
(require 'org-indent)
;; (require 'org-indent
;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

;; Get rid of the background on column views
(set-face-attribute 'org-column nil :background nil)
(set-face-attribute 'org-column-title nil :background nil)
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! org-present)
#+end_src

#+begin_src emacs-lisp
;; Install visual-fill-column
(unless (package-installed-p 'visual-fill-column)
  (package-install 'visual-fill-column))


(defun dw/org-present-start ()
  ;; Center the presentation and wrap lines
  (visual-fill-column-mode 1)
  (visual-line-mode 1))

(defun dw/org-present-end ()
  ;; Stop centering the document
  (visual-fill-column-mode 0)
  (visual-line-mode 0))


(defun dw/org-present-prepare-slide ()
  (org-overview)
  (org-show-entry)
  (org-show-children))

(defun dw/org-present-hook ()
       ;; Configure fill width
  (setq visual-fill-column-width 110
      visual-fill-column-center-text t)
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
					  (header-line (:height 4.0) variable-pitch)
					  (org-document-title (:height 1.75) org-document-title)
					  (org-code (:height 1.55) org-code)
					  (org-verbatim (:height 1.55) org-verbatim)
					  (org-block (:height 1.40) org-block)
					  (org-block-begin-line (:height 0.7) org-block)))
  (setq header-line-format " ")
  (org-appear-mode -1)
  (org-display-inline-images)
  (dw/org-present-prepare-slide))

(defun dw/org-present-quit-hook ()
  (setq-local face-remapping-alist '((default variable-pitch default)))
  (setq header-line-format nil)
  (org-present-small)
  (org-remove-inline-images)
  (org-appear-mode 1))

(defun dw/org-present-prev ()
  (interactive)
  (org-present-prev)
  (dw/org-present-prepare-slide))

(defun dw/org-present-next ()
  (interactive)
  (org-present-next)
  (dw/org-present-prepare-slide))

(use-package! org-present
  :bind (:map org-present-mode-keymap
		   ("C-c C-j" . dw/org-present-next)
		   ("C-c C-k" . dw/org-present-prev))
  :hook ((org-present-mode . dw/org-present-hook)
     (org-present-mode-quit . dw/org-present-quit-hook)
     (org-present-mode-hook . dw/org-present-start)
     (org-present-mode-quit-hook . dw/org-present-end)))
;; Register hooks with org-present
;; (add-hook 'org-present-mode-hook 'my/org-present-start)
;; (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
#+end_src


#+begin_src emacs-lisp
;;; Theme and Fonts ----------------------------------------

;; ;; Install doom-themes
;; (unless (package-installed-p 'doom-themes)
;;   (package-install 'doom-themes))

;; ;; Load up doom-palenight for the System Crafters look
;; (load-theme 'doom-palenight t)

;; ;; Set reusable font name variables
;; (defvar my/fixed-width-font "JetBrains Mono"
;;   "The font to use for monospaced (fixed width) text.")

;; (defvar my/variable-width-font "Iosevka Aile"
;;   "The font to use for variable-pitch (document) text.")

;; ;; NOTE: These settings might not be ideal for your machine, tweak them as needed!
;; (set-face-attribute 'default nil :font my/fixed-width-font :weight 'light :height 100)
;; (set-face-attribute 'fixed-pitch nil :font my/fixed-width-font :weight 'light :height 110)
;; (set-face-attribute 'variable-pitch nil :font my/variable-width-font :weight 'light)

;;; Org Mode Appearance ------------------------------------

;; Load org-faces to make sure we can set appropriate faces
(require 'org-faces)

;; Hide emphasis markers on formatted text
(setq org-hide-emphasis-markers t)

;; Resize Org headings
(dolist (face '((org-level-1 . 1.2)
                (org-level-2 . 1.1)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1))))
;; (set-face-attribute (car face) nil :font my/variable-width-font :weight 'medium :height (cdr face)))

;; Make the document title a bit bigger
;; (set-face-attribute 'org-document-title nil :font my/variable-width-font :weight 'bold :height 1.3)

;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

;;; Centering Org Documents --------------------------------

;; Install visual-fill-column
(unless (package-installed-p 'visual-fill-column)
  (package-install 'visual-fill-column))

;; Configure fill width
(setq visual-fill-column-width 110
      visual-fill-column-center-text t)

;;; Org Present --------------------------------------------

;; Install org-present if needed
(unless (package-installed-p 'org-present)
  (package-install 'org-present))

(defun my/org-present-prepare-slide (buffer-name heading)
  ;; Show only top-level headlines
  (org-overview)

  ;; Unfold the current entry
  (org-show-entry)

  ;; Show only direct subheadings of the slide but don't expand them
  (org-show-children))

(defun my/org-present-start ()
  ;; Tweak font sizes
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                     (header-line (:height 2.0) variable-pitch)
                                     (org-document-title (:height 1.75) org-document-title)
                                     (org-code (:height 1.55) org-code)
                                     (org-verbatim (:height 1.55) org-verbatim)
                                     (org-block (:height 1.25) org-block)
                                     (org-block-begin-line (:height 0.7) org-block)))

  ;; Set a blank header line string to create blank space at the top
  (setq header-line-format " ")

  ;; Display inline images automatically
  (org-display-inline-images)

  ;; Center the presentation and wrap lines
  (visual-fill-column-mode 1)
  (visual-line-mode 1))

(defun my/org-present-end ()
  ;; Reset font customizations
  (setq-local face-remapping-alist '((default variable-pitch default)))

  ;; Clear the header line string so that it isn't displayed
  (setq header-line-format nil)

  ;; Stop displaying inline images
  (org-remove-inline-images)

  ;; Stop centering the document
  (visual-fill-column-mode 0)
  (visual-line-mode 0))

;; Turn on variable pitch fonts in Org Mode buffers
(add-hook 'org-mode-hook 'variable-pitch-mode)

;; Register hooks with org-present
(add-hook 'org-present-mode-hook 'my/org-present-start)
(add-hook 'org-present-mode-quit-hook 'my/org-present-end)
(add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide)
#+end_src

#+RESULTS:
| my/org-present-prepare-slide |

#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

#+RESULTS:
: t

# * Funcs #+begin_src emacs-lisp
# #+end_src

# #+RESULTS:
# : insert-file-name
#
