.doom.d/Emacs.org
* OpenAI
#+begin_src emacs-lisp
;; if you are using the "pass" password manager
(setq chatgpt-shell-openai-key
        (nth 0 (process-lines "pass" "show" "AI/open")))
(setq openai-key (nth 0 (process-lines "pass" "show" "AI/open")))
#+end_src

#+begin_src emacs-lisp
;; (add-to-list 'loa-path "~/.emacs.d/lisp/")
(require 'codegpt)
(require 'chatgpt)
;; (package! chatgtp
;;   :recipe (:host jcs-elpa
;;            :repo "https://jcs-emacs.github.io/jcs-elpa/packages/")) ;; Optional: specify a specific commit or version

;; (package! codegtp)
  ;; :recipe (:host jcs-elpa))
           ;; :repo "https://github.com/emacs-openai/codegpt")) ;; Optional: specify a specific commit or version

;; (package! chatgtp
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/chatgtp"))
;; (package! codegtp)
#+end_src

#+RESULTS:
: chatgpt

#+begin_src emacs-lisp :tangle packages.el
;; (package! chatgpt-shell
;;   :recipe
;;   (:host github
;;    :repo "xenodium/chatgpt-shell"))
#+end_src

#+begin_src emacs-lisp
(add-to-list 'package-archives '( "jcs-elpa" . "https://jcs-emacs.github.io/jcs-elpa/packages/") t)
(setq package-archive-priorities '(("melpa"    . 5)
                                   ("jcs-elpa" . 0)))
#+end_src

#+RESULTS:
: ((melpa . http://melpa.org/packages/) (org . http://orgmode.org/elpa/) (gnu . https://elpa.gnu.org/packages/) (jcs-elpa . https://jcs-emacs.github.io/jcs-elpa/packages/))

#+begin_src emacs-lisp :tangle packages.el
;; (package! dall-e
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/dall-e"
;;    :files ("*.el")))

;; (package! chatgpt
;;   :recipe
;;   (:host github
;;    :repo "emacs-openai/chatgpt"
;;    :files ("*.el")))
#+end_src

#+begin_src emacs-lisp
;; (require 'chatgpt-shell)
;; (require 'dall-e-shell)
#+end_src

#+RESULTS:
: dall-e-shell
